stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_mdf.c
      /* Configure filter and start acquisition */
      hmdf->Instance->DFLTCR = 0U;
      MDF_AcqStart(hmdf, pFilterConfig);
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop acquisition in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    /* Check if state is ready and filter active */
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != MDF_DFLTCR_DFLTACTIVE)
      {
        status = HAL_ERROR;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Disable sound activity detector if needed */
    if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
    {
      hmdf->Instance->SADCR &= ~(MDF_SADCR_SADEN);
    }
  }

  if (status == HAL_OK)
  {
    /* Disable filter */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DFLTEN);

    /* Disable interrupts and clear all potential pending flags */
    hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_FTHIE | MDF_DFLTIER_DOVRIE | MDF_DFLTIER_SATIE |
                                 MDF_DFLTIER_RFOVRIE | MDF_DFLTIER_SDDETIE | MDF_DFLTIER_SDLVLIE);
    hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF |
                                MDF_DFLTISR_SDDETF | MDF_DFLTISR_SDLVLF);

    /* Update state */
    hmdf->State = HAL_MDF_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start acquisition in DMA mode.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @param  pDmaConfig DMA configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStart_DMA(MDF_HandleTypeDef *hmdf, const MDF_FilterConfigTypeDef *pFilterConfig,
                                       const MDF_DmaConfigTypeDef *pDmaConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if ((pFilterConfig == NULL) || (pDmaConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_FUNCTIONAL_STATE(pDmaConfig->MsbOnly));
    assert_param(IS_MDF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
    assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    if ((pFilterConfig->SoundActivity.Activation == ENABLE) &&
        ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_WINDOW_CONT)))
    {
      status = HAL_ERROR;
    }
    /* Check state */
    else if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
    /* Check filter status */
    else if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Check SAD status */
      if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
      {
        status = HAL_ERROR;
      }
    }

    if (status == HAL_OK)
    {
      uint32_t SrcAddress;

      if (pFilterConfig->ReshapeFilter.Activation == ENABLE)
      {
        /* Enable reshape filter overrun interrupt */
        hmdf->Instance->DFLTIER |= MDF_DFLTIER_RFOVRIE;
      }

      /* Enable saturation interrupt */
      hmdf->Instance->DFLTIER |= MDF_DFLTIER_SATIE;

      if (pFilterConfig->SoundActivity.Activation == ENABLE)
      {
        /* Enable sound level value ready and sound activity detection interrupts */
        assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.SoundLevelInterrupt));
        hmdf->Instance->DFLTIER |= (pFilterConfig->SoundActivity.SoundLevelInterrupt == ENABLE) ?
                                   (MDF_DFLTIER_SDLVLIE | MDF_DFLTIER_SDDETIE) :
                                   MDF_DFLTIER_SDDETIE;
      }

      /* Enable MDF DMA requests */
      hmdf->Instance->DFLTCR = MDF_DFLTCR_DMAEN;

      /* Start DMA transfer */
      hmdf->hdma->XferCpltCallback     = MDF_DmaXferCpltCallback;
      hmdf->hdma->XferHalfCpltCallback = MDF_DmaXferHalfCpltCallback;
      hmdf->hdma->XferErrorCallback    = MDF_DmaErrorCallback;
      SrcAddress = (pDmaConfig->MsbOnly == ENABLE) ? (((uint32_t) &hmdf->Instance->DFLTDR) + 2U) :
                   (uint32_t) &hmdf->Instance->DFLTDR;
      if ((hmdf->hdma->Mode & DMA_LINKEDLIST) == DMA_LINKEDLIST)
      {
        if (hmdf->hdma->LinkedListQueue != NULL)
        {
          hmdf->hdma->LinkedListQueue->Head->LinkRegisters[NODE_CBR1_DEFAULT_OFFSET] = pDmaConfig->DataLength;
          hmdf->hdma->LinkedListQueue->Head->LinkRegisters[NODE_CSAR_DEFAULT_OFFSET] = SrcAddress;
          hmdf->hdma->LinkedListQueue->Head->LinkRegisters[NODE_CDAR_DEFAULT_OFFSET] = pDmaConfig->Address;

          status = HAL_DMAEx_List_Start_IT(hmdf->hdma);
        }
        else
        {
          status = HAL_ERROR;
        }
      }
      else
      {
        status = HAL_DMA_Start_IT(hmdf->hdma, SrcAddress, pDmaConfig->Address, pDmaConfig->DataLength);
      }
      if (status != HAL_OK)
      {
        /* Update state */
        hmdf->State = HAL_MDF_STATE_ERROR;
        status = HAL_ERROR;
      }
      else
      {
        /* Configure filter and start acquisition */
        MDF_AcqStart(hmdf, pFilterConfig);
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop acquisition in DMA mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStop_DMA(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check if state is ready and filter active */
  if (hmdf->State == HAL_MDF_STATE_READY)
  {
    if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != MDF_DFLTCR_DFLTACTIVE)
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Stop the DMA transfer */
      if (HAL_DMA_Abort(hmdf->hdma) != HAL_OK)
      {
        /* Update state */
        hmdf->State = HAL_MDF_STATE_ERROR;
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Disable sound activity detector if needed */
    if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
    {
      hmdf->Instance->SADCR &= ~(MDF_SADCR_SADEN);
    }

    /* Disable filter */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DFLTEN);

    /* Disable interrupts and clear all potential pending flags */
    hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_SATIE | MDF_DFLTIER_RFOVRIE | MDF_DFLTIER_SDDETIE |
                                 MDF_DFLTIER_SDLVLIE);
    hmdf->Instance->DFLTISR |= (MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF | MDF_DFLTISR_SDDETF |
                                MDF_DFLTISR_SDLVLF);

    /* Disable MDF DMA requests */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DMAEN);

    /* Update state */
    hmdf->State = HAL_MDF_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to generate pulse on TRGO signal.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_GenerateTrgo(const MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_READY)
  {
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check if trigger output control is already active */
    if ((ADF1->GCR & MDF_GCR_TRGO) == MDF_GCR_TRGO)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Generate pulse on trigger output control signal */
      ADF1->GCR |= MDF_GCR_TRGO;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to set delay to apply on data source in number of samples.
  * @param  hmdf MDF handle.
  * @param  Delay Delay to apply on data source in number of samples.
  *         This parameter must be a number between Min_Data = 0 and Max_Data = 127.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_SetDelay(MDF_HandleTypeDef *hmdf, uint32_t Delay)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_DELAY(Delay));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check if bitstream delay is already active */
    if ((hmdf->Instance->DLYCR & MDF_DLYCR_SKPBF) == MDF_DLYCR_SKPBF)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Configure bitstream delay */
      hmdf->Instance->DLYCR |= Delay;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to get current delay applied on data source in number of samples.
  * @param  hmdf MDF handle.
  * @param  pDelay Current delay applied on data source in number of samples.
  *         This value is between Min_Data = 0 and Max_Data = 127.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_GetDelay(const MDF_HandleTypeDef *hmdf, uint32_t *pDelay)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pDelay == NULL)
  {
    status = HAL_ERROR;
  }
  /* Check state */
  else if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Get current bitstream delay */
    *pDelay = (hmdf->Instance->DLYCR & MDF_DLYCR_SKPDLY);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to set filter gain.
  * @param  hmdf MDF handle.
  * @param  Gain Filter gain in step of around 3db (from -48db to 72dB).
  *         This parameter must be a number between Min_Data = -16 and Max_Data = 24.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_SetGain(MDF_HandleTypeDef *hmdf, int32_t Gain)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_GAIN(Gain));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t register_gain_value;
    uint32_t tmp_register;

    if (Gain < 0)
    {
      int32_t adjust_gain;

      /* adjust gain value to set on register for negative value (offset of -16) */
      adjust_gain = Gain - 16;
      register_gain_value = ((uint32_t) adjust_gain & 0x3FU);
    }
    else
    {
      /* for positive value, no offset to apply */
      register_gain_value = (uint32_t) Gain;
    }
    /* Set gain */
    tmp_register = (hmdf->Instance->DFLTCICR & ~(MDF_DFLTCICR_SCALE));
    hmdf->Instance->DFLTCICR = (tmp_register | (register_gain_value << MDF_DFLTCICR_SCALE_Pos));
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to get filter gain.
  * @param  hmdf MDF handle.
  * @param  pGain Filter gain in step of around 3db (from -48db to 72dB).
  *         This parameter is between Min_Data = -16 and Max_Data = 24.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_GetGain(const MDF_HandleTypeDef *hmdf, int32_t *pGain)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pGain == NULL)
  {
    status = HAL_ERROR;
  }
  /* Check state */
  else if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t register_gain_value;

    /* Get current gain */
    register_gain_value = ((hmdf->Instance->DFLTCICR & MDF_DFLTCICR_SCALE) >> MDF_DFLTCICR_SCALE_Pos);
    if (register_gain_value > 31U)
    {
      /* adjust gain value to set on register for negative value (offset of +16) */
      register_gain_value |= 0xFFFFFFC0U;
      *pGain = (int32_t) register_gain_value + 16;
    }
    else
    {
      /* for positive value, no offset to apply */
      *pGain = (int32_t) register_gain_value;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for sound level data.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @param  pSoundLevel Sound level.
            This parameter can be a value between Min_Data = 0 and Max_Data = 32767.
  * @param  pAmbientNoise Ambient noise.
            This parameter can be a value between Min_Data = 0 and Max_Data = 32767.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_PollForSndLvl(MDF_HandleTypeDef *hmdf, uint32_t Timeout, uint32_t *pSoundLevel,
                                        uint32_t *pAmbientNoise)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if ((pSoundLevel == NULL) || (pAmbientNoise == NULL))
  {
    status = HAL_ERROR;
  }
  /* Check state */
  else if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  /* Check SAD status */
  else if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) == 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t tickstart = HAL_GetTick();

    /* Wait for available sound level data */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_SDLVLF) != MDF_DFLTISR_SDLVLF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Get sound level */
      *pSoundLevel = hmdf->Instance->SADSDLVR;

